Dittlau/nRF52/main.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for handling write events to the LED characteristic.
 *
 * @param[in] p_led_service  Instance of LED Service to which the write applies.
 * @param[in] led_state      Written/desired state of the LED.
 */
static void led_write_handler(uint16_t conn_handle, ble_led_service_t * p_led_service, uint8_t led_state)
{
    if (led_state)
    {
        nrf_gpio_pin_set(LIGHTBULB_LED);
        nrf_gpio_pin_set(YELLOW1);
        nrf_gpio_pin_set(YELLOW2);
        nrf_gpio_pin_set(RED1);
        //bsp_board_led_on(LIGHTBULB_LED);
        NRF_LOG_INFO("Received LED ON!");
    }
    else
    {
        //bsp_board_led_off(LIGHTBULB_LED);
        nrf_gpio_pin_clear(LIGHTBULB_LED);
        nrf_gpio_pin_clear(YELLOW1);
        nrf_gpio_pin_clear(YELLOW2);
        nrf_gpio_pin_clear(RED1);
        NRF_LOG_INFO("Received LED OFF!");
    }
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

        APP_ERROR_CHECK(err_code);
    }
}


// Event handler for PWM (returns here when ending a sequence)
static void event_handler(nrf_drv_pwm_evt_type_t event_type)
{
    if(event_type == NRFX_PWM_EVT_END_SEQ0)
    {
        //Update sequence 0
        //seq_values.channel_0 = 0;
        //seq_values.channel_1 = 0;
        //seq_values.channel_2 = 0;
        //nrf_delay_ms(500);
        NRF_LOG_INFO("Sequence ended in event handler\r\n");
    }
}



/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    log_init();
    timers_init();
    battery_voltage_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    conn_params_init();
    peer_manager_init();

    // Start execution.
    NRF_LOG_INFO("BLE Lightbulb example started.");
    application_timers_start();

    advertising_start(erase_bonds);
    

    // Setup pin for output
    nrf_gpio_cfg_output(LIGHTBULB_LED);
    

    flame_setup();


    // Setup of PWM
    // Remember to enable both PWM and which of the three PWM's to use in sdk_config.h

    static nrf_drv_pwm_t m_pwm0 = NRF_DRV_PWM_INSTANCE(0);
    static uint16_t const m_top  = 5000;


    nrf_drv_pwm_config_t const config0 =
    {
        .output_pins =
        {
            YELLOW1,// channel 0
            RED1, // channel 1
            YELLOW2, // channel 2
            28  // channel 3
        },
        .irq_priority = APP_IRQ_PRIORITY_LOWEST,
        .base_clock   = NRF_PWM_CLK_250kHz,
        .count_mode   = NRF_PWM_MODE_UP,
        .top_value    = m_top,
        .load_mode    = NRF_PWM_LOAD_INDIVIDUAL,
        .step_mode    = NRF_PWM_STEP_AUTO
    };

    
    static nrf_pwm_sequence_t const seq =
    {
        .values.p_individual = &seq_values,
        .length              = NRF_PWM_VALUES_LENGTH(seq_values),
        .repeats             = 0,
        .end_delay           = 0
    };

    uint32_t err_code;
    
    err_code = nrf_drv_pwm_init(&m_pwm0, &config0, NULL);
    APP_ERROR_CHECK(err_code);
    
    nrf_drv_pwm_simple_playback(&m_pwm0, &seq, 1,  NRF_DRV_PWM_FLAG_LOOP | NRF_DRV_PWM_FLAG_SIGNAL_END_SEQ0);


    // Seed with timestamp, to get more "randomness"
    srand(time(NULL));

    

    // Enter main loop.
    for (;;)
    {
        //idle_state_handle();


        // 16'th bit sets the polarity of the pwm (1 << 15 is active high) 
        seq_values.channel_0 = (rand() % 2500 + 1000) | (1 << 15); // random between 1000 and 3500
        seq_values.channel_1 = (rand() % 2500 + 1000) | (1 << 15);;
        seq_values.channel_2 = (rand() % 2500 + 1000) | (1 << 15);;
        nrf_delay_ms(rand() % 100 + 100);

        //servo test - must be between 250 and 500
//        seq_values.channel_3 = 250;// | (1 << 15);
//        nrf_delay_ms(1000);
//        seq_values.channel_3 = 375;// | (1 << 15);
//        nrf_delay_ms(1000);
//        seq_values.channel_3 = 500;// | (1 << 15);
//        nrf_delay_ms(1000);
    }
}


/**
 * @}
 */